<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"1794ce8eb7571086a30a6e91f3808417036e48b4f0287a19ea235040801843d8","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #715 at https://github.com/cal-itp/data-infra/actions/runs/18025057657","plan_out_hash":"0c7b5abb0050949fcfa0513bb3cb005f6e8c2a4930eceaa860dce80e70033191","plan_hash":"39a17720ae4715223e0cac093f90609f1d27df596d8e622ae06ff88372229b85","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 2 to add, 20 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Cc/LmA==" -> (known after apply)
!~      detect_md5hash      = "qeFkhFcGzhVivpfU+nEiVQ==" -> "different hash"
!~      generation          = 1758847198049249 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/METADATA.yml"
!~      md5hash             = "qeFkhFcGzhVivpfU+nEiVQ==" -> (known after apply)
        name                = "dags/copy_production_to_staging/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/airtable_california_transit.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "fr0XnA==" -> (known after apply)
!~      detect_md5hash      = "/UYTgwx/z9mdvu1sf2i/nw==" -> "different hash"
!~      generation          = 1758847197518032 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/airtable_california_transit.yml"
!~      md5hash             = "/UYTgwx/z9mdvu1sf2i/nw==" -> (known after apply)
        name                = "dags/copy_production_to_staging/airtable_california_transit.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/airtable_transit_data_quality_issues.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "uW9X4A==" -> (known after apply)
!~      detect_md5hash      = "TQbuZzRlZc+itsrxL8dqpQ==" -> "different hash"
!~      generation          = 1758847197501290 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/airtable_transit_data_quality_issues.yml"
!~      md5hash             = "TQbuZzRlZc+itsrxL8dqpQ==" -> (known after apply)
        name                = "dags/copy_production_to_staging/airtable_transit_data_quality_issues.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/airtable_transit_technology_stacks.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "ipuJig==" -> (known after apply)
!~      detect_md5hash      = "j/iZsFPWkTDbAM3DZ9ZTmA==" -> "different hash"
!~      generation          = 1758847197497788 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/airtable_transit_technology_stacks.yml"
!~      md5hash             = "j/iZsFPWkTDbAM3DZ9ZTmA==" -> (known after apply)
        name                = "dags/copy_production_to_staging/airtable_transit_technology_stacks.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/display_copy_date.yml"] will be destroyed
  # (because key ["dags/copy_production_to_staging/display_copy_date.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "zqBQJw==" -> null
-       detect_md5hash      = "Os975v/YP/fqmd+DEzsa+w==" -> null
-       event_based_hold    = false -> null
-       generation          = 1758847198393875 -> null
-       id                  = "calitp-staging-composer-dags/copy_production_to_staging/display_copy_date.yml" -> null
-       md5hash             = "Os975v/YP/fqmd+DEzsa+w==" -> null
-       md5hexhash          = "3acf7be6ffd83ff7ea99df83133b1afb" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fcopy_production_to_staging%2Fdisplay_copy_date.yml?generation=1758847198393875&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/copy_production_to_staging/display_copy_date.yml" -> null
-       output_name         = "dags/copy_production_to_staging/display_copy_date.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fcopy_production_to_staging%2Fdisplay_copy_date.yml" -> null
-       source              = "../../../../airflow/dags/copy_production_to_staging/display_copy_date.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_aggregator_scrape_results.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "upK51Q==" -> (known after apply)
!~      detect_md5hash      = "lTz09ZyTMsbmhpPA/RBn6A==" -> "different hash"
!~      generation          = 1758847198396775 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/gtfs_aggregator_scrape_results.yml"
!~      md5hash             = "lTz09ZyTMsbmhpPA/RBn6A==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_aggregator_scrape_results.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_parsed_service_alerts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "jWspSg==" -> (known after apply)
!~      detect_md5hash      = "O0PQo9gHY9+C4MLiP1dXcw==" -> "different hash"
!~      generation          = 1758847198041409 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/gtfs_rt_parsed_service_alerts.yml"
!~      md5hash             = "O0PQo9gHY9+C4MLiP1dXcw==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_rt_parsed_service_alerts.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_parsed_trip_updates.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "huuHcg==" -> (known after apply)
!~      detect_md5hash      = "I03aVuNUujLe0wYfZvs+iw==" -> "different hash"
!~      generation          = 1758847198358077 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/gtfs_rt_parsed_trip_updates.yml"
!~      md5hash             = "I03aVuNUujLe0wYfZvs+iw==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_rt_parsed_trip_updates.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_parsed_vehicle_positions.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "cIKlQg==" -> (known after apply)
!~      detect_md5hash      = "m8ym9L41Duu2mpeleIBZ9g==" -> "different hash"
!~      generation          = 1758847197653194 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/gtfs_rt_parsed_vehicle_positions.yml"
!~      md5hash             = "m8ym9L41Duu2mpeleIBZ9g==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_rt_parsed_vehicle_positions.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_schedule_parsed.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "ixOW7A==" -> (known after apply)
!~      detect_md5hash      = "GfyJs8rsqomr3mTx04Waug==" -> "different hash"
!~      generation          = 1758847198403296 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/gtfs_rt_schedule_parsed.yml"
!~      md5hash             = "GfyJs8rsqomr3mTx04Waug==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_rt_schedule_parsed.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_schedule_parsed_txt_results.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_rt_schedule_parsed_txt_results.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_rt_schedule_parsed_txt_results.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_validation_service_alerts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Nmj+FQ==" -> (known after apply)
!~      detect_md5hash      = "bs1F6yuao0NpubzsxzCqnQ==" -> "different hash"
!~      generation          = 1758847198359017 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/gtfs_rt_validation_service_alerts.yml"
!~      md5hash             = "bs1F6yuao0NpubzsxzCqnQ==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_rt_validation_service_alerts.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_validation_trip_updates.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "ijKa9A==" -> (known after apply)
!~      detect_md5hash      = "d7qtJ3wf3+dNs/XreijXLw==" -> "different hash"
!~      generation          = 1758847197968004 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/gtfs_rt_validation_trip_updates.yml"
!~      md5hash             = "d7qtJ3wf3+dNs/XreijXLw==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_rt_validation_trip_updates.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_rt_validation_vehicle_positions.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "pq47fA==" -> (known after apply)
!~      detect_md5hash      = "PPiwpUT5uhdjIQFwL74Ikg==" -> "different hash"
!~      generation          = 1758847197520383 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/gtfs_rt_validation_vehicle_positions.yml"
!~      md5hash             = "PPiwpUT5uhdjIQFwL74Ikg==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_rt_validation_vehicle_positions.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_schedule.yml"] will be destroyed
  # (because key ["dags/copy_production_to_staging/gtfs_schedule.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "/Zqasg==" -> null
-       detect_md5hash      = "80J8Lgr2gYCwHiLQ1EuU3g==" -> null
-       event_based_hold    = false -> null
-       generation          = 1758847198406675 -> null
-       id                  = "calitp-staging-composer-dags/copy_production_to_staging/gtfs_schedule.yml" -> null
-       md5hash             = "80J8Lgr2gYCwHiLQ1EuU3g==" -> null
-       md5hexhash          = "f3427c2e0af68180b01e22d0d44b94de" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fcopy_production_to_staging%2Fgtfs_schedule.yml?generation=1758847198406675&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/copy_production_to_staging/gtfs_schedule.yml" -> null
-       output_name         = "dags/copy_production_to_staging/gtfs_schedule.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fcopy_production_to_staging%2Fgtfs_schedule.yml" -> null
-       source              = "../../../../airflow/dags/copy_production_to_staging/gtfs_schedule.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_schedule_download_configs.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "UN91ag==" -> (known after apply)
!~      detect_md5hash      = "z87f14PTE5qNJwOjBGJv4A==" -> "different hash"
!~      generation          = 1758847197961125 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/gtfs_schedule_download_configs.yml"
!~      md5hash             = "z87f14PTE5qNJwOjBGJv4A==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_schedule_download_configs.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_schedule_download_outcomes.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_schedule_download_outcomes.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_schedule_download_outcomes.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_schedule_unzip_outcomes.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "dHY7Ew==" -> (known after apply)
!~      detect_md5hash      = "qs+6S7+ABUPVYBRK2eFtAw==" -> "different hash"
!~      generation          = 1758847197517770 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/gtfs_schedule_unzip_outcomes.yml"
!~      md5hash             = "qs+6S7+ABUPVYBRK2eFtAw==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_schedule_unzip_outcomes.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_schedule_validation_notices.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "XaEmYQ==" -> (known after apply)
!~      detect_md5hash      = "3G0BWCh/yDW2ijk0gHzoMQ==" -> "different hash"
!~      generation          = 1758847197200411 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/gtfs_schedule_validation_notices.yml"
!~      md5hash             = "3G0BWCh/yDW2ijk0gHzoMQ==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_schedule_validation_notices.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/gtfs_schedule_validation_outcomes.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Vsqo/Q==" -> (known after apply)
!~      detect_md5hash      = "PjttoPJsqOa6d4Y4DiEGEQ==" -> "different hash"
!~      generation          = 1758847197959242 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/gtfs_schedule_validation_outcomes.yml"
!~      md5hash             = "PjttoPJsqOa6d4Y4DiEGEQ==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_schedule_validation_outcomes.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/copy_production_to_staging/state_highway_network.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "mx/blQ==" -> (known after apply)
!~      detect_md5hash      = "5MmL5czGDNA6I+lggQ1wcg==" -> "different hash"
!~      generation          = 1758847197507070 -> (known after apply)
        id                  = "calitp-staging-composer-dags/copy_production_to_staging/state_highway_network.yml"
!~      md5hash             = "5MmL5czGDNA6I+lggQ1wcg==" -> (known after apply)
        name                = "dags/copy_production_to_staging/state_highway_network.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_kuba/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "s/KVPg==" -> (known after apply)
!~      detect_md5hash      = "rYX57iU0NadWmDL/eY1oCg==" -> "different hash"
!~      generation          = 1753225939204799 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_kuba/METADATA.yml"
!~      md5hash             = "rYX57iU0NadWmDL/eY1oCg==" -> (known after apply)
        name                = "dags/sync_kuba/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_kuba/device_monitoring.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "a/JjaQ==" -> (known after apply)
!~      detect_md5hash      = "mz5R6E4lg2YhyH3MUlytOQ==" -> "different hash"
!~      generation          = 1752622236021342 -> (known after apply)
        id                  = "calitp-staging-composer-dags/sync_kuba/device_monitoring.yml"
!~      md5hash             = "mz5R6E4lg2YhyH3MUlytOQ==" -> (known after apply)
        name                = "dags/sync_kuba/device_monitoring.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/kuba_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "JTC8rw==" -> (known after apply)
!~      detect_md5hash      = "i8NNRbEgt8nlVzklbCzVCg==" -> "different hash"
!~      generation          = 1755038577941101 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/kuba_to_gcs_operator.py"
!~      md5hash             = "i8NNRbEgt8nlVzklbCzVCg==" -> (known after apply)
        name                = "plugins/operators/kuba_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

Plan: 2 to add, 20 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #715](https://github.com/cal-itp/data-infra/actions/runs/18025057657)